In [1]:
import pandas as pd
import numpy as np

In [4]:
df = pd.DataFrame(np.random.randn(8, 3), columns=['A', 'B', 'C'])
df

          A         B         C
0 -2.058223 -0.170641  0.346371
1  0.062418  1.262566 -0.568891
2  2.490719 -1.570505 -1.611380
3 -0.589267 -0.247511  0.371405
4 -0.480264 -2.681051 -1.137488
5 -0.766561  1.093734  0.201524
6  0.456668 -0.627374 -1.039025
7  1.296408 -1.192452 -0.661811

In [5]:
df.columns = [x.lower() for x in df.columns]
df

          a         b         c
0 -2.058223 -0.170641  0.346371
1  0.062418  1.262566 -0.568891
2  2.490719 -1.570505 -1.611380
3 -0.589267 -0.247511  0.371405
4 -0.480264 -2.681051 -1.137488
5 -0.766561  1.093734  0.201524
6  0.456668 -0.627374 -1.039025
7  1.296408 -1.192452 -0.661811

In [7]:
df.a.array

<PandasArray>
[  -2.058223067208368,  0.06241768311698291,   2.4907189989035676,
  -0.5892669833427974, -0.48026386190306075,  -0.7665613525609863,
   0.4566682095850525,    1.296407862952543]
Length: 8, dtype: float64

In [10]:
data = np.random.randint(0, 7, size=50)
data

array([5, 0, 5, 5, 1, 2, 3, 5, 6, 2, 0, 2, 3, 5, 2, 1, 4, 1, 3, 0, 5, 5,
       5, 6, 3, 0, 4, 3, 3, 2, 3, 4, 2, 0, 1, 6, 0, 4, 2, 5, 2, 0, 6, 6,
       6, 3, 2, 3, 4, 2])

In [12]:
s = pd.Series(data)
s

0     5
1     0
2     5
3     5
4     1
5     2
6     3
7     5
8     6
9     2
10    0
11    2
12    3
13    5
14    2
15    1
16    4
17    1
18    3
19    0
20    5
21    5
22    5
23    6
24    3
25    0
26    4
27    3
28    3
29    2
30    3
31    4
32    2
33    0
34    1
35    6
36    0
37    4
38    2
39    5
40    2
41    0
42    6
43    6
44    6
45    3
46    2
47    3
48    4
49    2
dtype: int64

In [13]:
s.value_counts()

2    10
5     9
3     9
0     7
6     6
4     5
1     4
dtype: int64

In [15]:
s5 = pd.Series([1, 1, 3, 3, 3, 5, 5, 7, 7, 7])
s5

0    1
1    1
2    3
3    3
4    3
5    5
6    5
7    7
8    7
9    7
dtype: int64

In [16]:
s5.mode()

0    3
1    7
dtype: int64

In [18]:
df5 = pd.DataFrame({"A": np.random.randint(0, 7, size=50),"B": np.random.randint(-10, 15, size=50)})
df5

    A   B
0   0   8
1   3  -9
2   3  -3
3   3   9
4   0  13
5   2 -10
6   5   8
7   3   3
8   0  -3
9   6  -1
10  1 -10
11  3  14
12  3   4
13  2  -4
14  1  11
15  5  -2
16  1  -3
17  2   2
18  5  -2
19  3  -2
20  1   9
21  5   0
22  0   6
23  6  -3
24  2  -2
25  4   1
26  1  -8
27  2  -6
28  4  -9
29  2   7
30  6  -8
31  4  -1
32  1  -7
33  2   5
34  2  -5
35  2 -10
36  6 -10
37  4   0
38  4 -10
39  3 -10
40  6   0
41  6  12
42  4  12
43  3   3
44  0  14
45  2  -2
46  1  12
47  5   5
48  2  -9
49  3 -10

In [19]:
df5.mode()

   A   B
0  2 -10

In [21]:
s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])
s

a   -1.840114
b   -1.502739
c    0.792498
d   -1.045924
e   -0.269735
dtype: float64

In [22]:
s.reindex(['e', 'b', 'f', 'd'])

e   -0.269735
b   -1.502739
f         NaN
d   -1.045924
dtype: float64

In [23]:
s

a   -1.840114
b   -1.502739
c    0.792498
d   -1.045924
e   -0.269735
dtype: float64

In [35]:
df = pd.DataFrame({ 'one': pd.Series(np.random.randn(3), index=['a', 'b', 'c']), 'two': pd.Series(np.random.randn(4), index=['a', 'b', 'c', 'd']), 'three': pd.Series(np.random.randn(3), index=['b', 'c', 'd'])})
df

        one       two     three
a -0.654113  0.994558       NaN
b  0.320375 -0.655427  0.432815
c -0.701690 -0.228893  0.833554
d       NaN  1.041331 -0.796225

In [39]:
df.reindex(index=['c', 'f', 'b'], columns=['three', 'two', 'one'])

      three       two       one
c  0.833554 -0.228893 -0.701690
f       NaN       NaN       NaN
b  0.432815 -0.655427  0.320375

In [38]:
df.reindex(['c','f', 'b'], axis='index')

        one       two     three
c -0.701690 -0.228893  0.833554
f       NaN       NaN       NaN
b  0.320375 -0.655427  0.432815

In [40]:
df

        one       two     three
a -0.654113  0.994558       NaN
b  0.320375 -0.655427  0.432815
c -0.701690 -0.228893  0.833554
d       NaN  1.041331 -0.796225

In [41]:
 df.drop(['a', 'd'], axis=0)

        one       two     three
b  0.320375 -0.655427  0.432815
c -0.701690 -0.228893  0.833554

In [43]:
df.drop(['one'], axis=1)

        two     three
a  0.994558       NaN
b -0.655427  0.432815
c -0.228893  0.833554
d  1.041331 -0.796225

In [44]:
s

a   -1.840114
b   -1.502739
c    0.792498
d   -1.045924
e   -0.269735
dtype: float64

In [45]:
s.rename(str.upper)

A   -1.840114
B   -1.502739
C    0.792498
D   -1.045924
E   -0.269735
dtype: float64

In [47]:
df.rename(columns={'one': 'foo', 'two': 'bar'},index={'a': 'apple', 'b': 'banana', 'd': 'durian'})

             foo       bar     three
apple  -0.654113  0.994558       NaN
banana  0.320375 -0.655427  0.432815
c      -0.701690 -0.228893  0.833554
durian       NaN  1.041331 -0.796225

In [49]:
df.rename({'one': 'foo', 'two': 'bar'}, axis='columns')

        foo       bar     three
a -0.654113  0.994558       NaN
b  0.320375 -0.655427  0.432815
c -0.701690 -0.228893  0.833554
d       NaN  1.041331 -0.796225

In [50]:
df.rename({'a': 'apple', 'b': 'banana', 'd': 'durian'}, axis='index')

             one       two     three
apple  -0.654113  0.994558       NaN
banana  0.320375 -0.655427  0.432815
c      -0.701690 -0.228893  0.833554
durian       NaN  1.041331 -0.796225

In [52]:
s = pd.Series(pd.date_range('20130101 09:10:12', periods=4))
s

0   2013-01-01 09:10:12
1   2013-01-02 09:10:12
2   2013-01-03 09:10:12
3   2013-01-04 09:10:12
dtype: datetime64[ns]

In [53]:
s.dt.hour

0    9
1    9
2    9
3    9
dtype: int64

In [54]:
s.dt.second

0    12
1    12
2    12
3    12
dtype: int64

In [55]:
s.dt.day

0    1
1    2
2    3
3    4
dtype: int64

In [56]:
s.dt.dayofweek

0    1
1    2
2    3
3    4
dtype: int64

In [63]:
stz = s.dt.tz_localize('US/Eastern')
stz

0   2013-01-01 09:10:12-05:00
1   2013-01-02 09:10:12-05:00
2   2013-01-03 09:10:12-05:00
3   2013-01-04 09:10:12-05:00
dtype: datetime64[ns, US/Eastern]

In [64]:
stz.dt.tz

In [65]:
s.dt.tz_localize('UTC').dt.tz_convert('US/Eastern')

0   2013-01-01 04:10:12-05:00
1   2013-01-02 04:10:12-05:00
2   2013-01-03 04:10:12-05:00
3   2013-01-04 04:10:12-05:00
dtype: datetime64[ns, US/Eastern]

In [67]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'],dtype="string")
s

0       A
1       B
2       C
3    Aaba
4    Baca
5    <NA>
6    CABA
7     dog
8     cat
dtype: string

In [68]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5    <NA>
6    caba
7     dog
8     cat
dtype: string

In [70]:
df = pd.DataFrame({
        'one': pd.Series(np.random.randn(3), index=['a', 'b', 'c']),
        'two': pd.Series(np.random.randn(4), index=['a', 'b', 'c', 'd']),
        'three': pd.Series(np.random.randn(3), index=['b', 'c', 'd'])})
df

        one       two     three
a  0.152244 -0.530384       NaN
b  0.634086  1.616270  0.814545
c  1.731093 -1.630984 -1.258391
d       NaN  0.088525 -0.691447

In [72]:
unsorted_df = df.reindex(index=['a', 'd', 'c', 'b'],
                          columns=['three', 'two', 'one'])
unsorted_df

      three       two       one
a       NaN -0.530384  0.152244
d -0.691447  0.088525       NaN
c -1.258391 -1.630984  1.731093
b  0.814545  1.616270  0.634086

In [74]:
unsorted_df.sort_index()

      three       two       one
a       NaN -0.530384  0.152244
b  0.814545  1.616270  0.634086
c -1.258391 -1.630984  1.731093
d -0.691447  0.088525       NaN

In [75]:
unsorted_df.sort_index(ascending=False)

      three       two       one
d -0.691447  0.088525       NaN
c -1.258391 -1.630984  1.731093
b  0.814545  1.616270  0.634086
a       NaN -0.530384  0.152244

In [76]:
unsorted_df.sort_index(axis=1)

        one     three       two
a  0.152244       NaN -0.530384
d       NaN -0.691447  0.088525
c  1.731093 -1.258391 -1.630984
b  0.634086  0.814545  1.616270

In [77]:
unsorted_df['three'].sort_index()

a         NaN
b    0.814545
c   -1.258391
d   -0.691447
Name: three, dtype: float64

In [78]:
df1 = pd.DataFrame({'one': [2, 1, 1, 1],
                        'two': [1, 3, 2, 4],
                        'three': [5, 4, 3, 2]})
df1

   one  two  three
0    2    1      5
1    1    3      4
2    1    2      3
3    1    4      2

In [81]:
df1.sort_values(by='one')

   one  two  three
1    1    3      4
2    1    2      3
3    1    4      2
0    2    1      5

In [80]:
df1[['one', 'two', 'three']].sort_values(by=['one', 'two'])

   one  two  three
2    1    2      3
1    1    3      4
3    1    4      2
0    2    1      5

In [82]:
s[2] = np.nan

In [84]:
s.sort_values()

0       A
3    Aaba
1       B
4    Baca
6    CABA
8     cat
7     dog
2    <NA>
5    <NA>
dtype: string

In [85]:
s.sort_values(na_position='first')

2    <NA>
5    <NA>
0       A
3    Aaba
1       B
4    Baca
6    CABA
8     cat
7     dog
dtype: string

In [91]:
idx = pd.MultiIndex.from_tuples([('a', 1), ('a', 2), ('a', 2),
                                   ('b', 2), ('b', 1), ('b', 1)])

In [92]:
idx

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 2),
            ('b', 2),
            ('b', 1),
            ('b', 1)],
           )

In [97]:
idx.names = ['first', 'second']
idx

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 2),
            ('b', 2),
            ('b', 1),
            ('b', 1)],
           names=['first', 'second'])

In [90]:
df_multi = pd.DataFrame({'A': np.arange(6, 0, -1)},
                            index=idx)
df_multi

              A
first second
a     1       6
      2       5
      2       4
b     2       3
      1       2
      1       1

In [95]:
df_multi.sort_values(by=['second', 'A'])

              A
first second
b     1       1
      1       2
a     1       6
b     2       3
a     2       4
      2       5